local sq = the_script()
sq:add(ScriptQuest.NPC_VISIT, 848)

local menu_848 = [[
function IsHasTask()
return true
end
function TaskDialog()
this:AddTalk("<n color=\"255,255,255,0\">尊敬的玩家 (GetName)</n><n color=\"255,0,255,255\">您好！</n>");
this:AddTalk("<n color=\"255,0,255,0\">欢迎</n>");
this:AddTalk("<n color=\"255,0,255,0\">你可以点击下方领取增伤装备</n>");
this:AddTalk("<n color=\"255,0,255,0\">输入领取码方可领取！</n>");
this:AddTaskCmdItem("领取增伤装备(0)", "accept_848", 21102, 1)
this:AddCloseItem("知道了")
end
]]

local menu_848_领取装备 = [[
function IsHasTask()
return true
end
function TaskDialog()
this:AddTalk("请选择新手装备。");
-- this:AddTaskCmdItem("战士增伤套(0)", "accept_848", 100, 1)
-- this:AddTaskCmdItem("弓手增伤套(0)", "accept_848", 100, 2)
-- this:AddTaskCmdItem("法师增伤套(0)", "accept_848", 100, 3)
-- this:AddTaskCmdItem("召唤增伤套(0)", "accept_848", 100, 4)
-- this:AddTaskCmdItem("仙术增伤套(0)", "accept_848", 100, 5)
-- this:AddTaskCmdItem("剑物增伤套(0)", "accept_848", 100, 6)
-- this:AddTaskCmdItem("剑魔增伤套(0)", "accept_848", 100, 7)
-- this:AddTaskCmdItem("利刃增伤套(0)", "accept_848", 100, 8)


 this:AddTaskCmdItem("领取增伤装备(0)", "accept_848", 100, 4)
 this:AddTaskCmdItem("领取材料(0)", "accept_848", 100, 5)

this:AddCloseItem("离开")
end
]]

local 临时NPC = nil
function visit_848(npc)
    临时NPC = npc
	show_dialog(npc, menu_848)
	return 1
end

function accept_848(npc, id, flag)
	local 当前角色 = me()
    if id == 21102 then
        if flag == 1 then
            当前角色:输入框("增伤装备领取","输入测试码","")
        end
    elseif id == 100 then
        local v = 当前角色.任务:vars(888888)
        local 增伤装备状态 = v:get("增伤装备")
v:set("增伤装备",0)
        if 增伤装备状态 == 0 then
            v:set("增伤装备",1)
            if flag == 1 then
                当前角色:制造装备({编号=10320,品质=4,星星=15,五行属性=2,灵魂增伤=5})
                当前角色:制造装备({编号=10719,品质=4,星星=15,五行属性=2,灵魂增伤=5})
	            当前角色:制造装备({编号=10119,品质=4,星星=15,五行属性=4,灵魂增伤=5})
				当前角色:制造装备({编号=10269,品质=4,星星=15,五行属性=4,灵魂增伤=5})
                当前角色:制造装备({编号=10989,品质=4,星星=15,五行属性=3,灵魂增伤=5})
                当前角色:制造装备({编号=11039,品质=4,星星=15,五行属性=0,灵魂增伤=5})
                当前角色:制造装备({编号=11039,品质=4,星星=15,五行属性=0,灵魂增伤=5})
                当前角色:制造装备({编号=10790,品质=4,星星=15,五行属性=0,灵魂增伤=5})
                当前角色:制造装备({编号=10840,品质=4,星星=15,五行属性=2,灵魂增伤=5})
                当前角色:制造装备({编号=10890,品质=4,星星=15,五行属性=2,灵魂增伤=5})
                当前角色:制造装备({编号=10890,品质=4,星星=15,五行属性=2,灵魂增伤=5})
                当前角色:制造装备({编号=10937,品质=4,星星=15,五行属性=4,灵魂增伤=5})
            elseif flag == 2 then
                当前角色:制造装备({编号=10570,品质=4,星星=15,五行属性=2,灵魂增伤=5})
				当前角色:制造装备({编号=13500,品质=4,星星=15,五行属性=2,灵魂增伤=5})
				当前角色:制造装备({编号=10119,品质=4,星星=15,五行属性=4,灵魂增伤=5})
				当前角色:制造装备({编号=10269,品质=4,星星=15,五行属性=4,灵魂增伤=5})
                当前角色:制造装备({编号=10989,品质=4,星星=15,五行属性=3,灵魂增伤=5})
                当前角色:制造装备({编号=11039,品质=4,星星=15,五行属性=0,灵魂增伤=5})
                当前角色:制造装备({编号=11039,品质=4,星星=15,五行属性=0,灵魂增伤=5})
				当前角色:制造装备({编号=10790,品质=4,星星=15,五行属性=0,灵魂增伤=5})
                当前角色:制造装备({编号=10840,品质=4,星星=15,五行属性=2,灵魂增伤=5})
                当前角色:制造装备({编号=10890,品质=4,星星=15,五行属性=2,灵魂增伤=5})
                当前角色:制造装备({编号=10890,品质=4,星星=15,五行属性=2,灵魂增伤=5})
                当前角色:制造装备({编号=10937,品质=4,星星=15,五行属性=4,灵魂增伤=5})
            elseif flag == 3 then
                当前角色:制造装备({编号=10520,品质=4,星星=15,五行属性=2,灵魂增伤=5})
				当前角色:制造装备({编号=13000,品质=4,星星=15,五行属性=2,灵魂增伤=5})
				当前角色:制造装备({编号=10069,品质=4,星星=15,五行属性=2,灵魂增伤=5})
				当前角色:制造装备({编号=10219,品质=4,星星=15,五行属性=2,灵魂增伤=5})
                当前角色:制造装备({编号=10990,品质=4,星星=15,五行属性=3,灵魂增伤=5})
                当前角色:制造装备({编号=11040,品质=4,星星=15,五行属性=0,灵魂增伤=5})
                当前角色:制造装备({编号=11040,品质=4,星星=15,五行属性=0,灵魂增伤=5})
				当前角色:制造装备({编号=10789,品质=4,星星=15,五行属性=3,灵魂增伤=5})
				当前角色:制造装备({编号=10839,品质=4,星星=15,五行属性=0,灵魂增伤=5})
				当前角色:制造装备({编号=10889,品质=4,星星=15,五行属性=0,灵魂增伤=5})
				当前角色:制造装备({编号=10889,品质=4,星星=15,五行属性=0,灵魂增伤=5})
				当前角色:制造装备({编号=10938,品质=4,星星=15,五行属性=2,灵魂增伤=5})
            -- elseif flag == 4 then
            --     当前角色:制造装备({编号=19331,品质=4,星星=15,五行属性=2,灵魂增伤=5})
            --     当前角色:制造装备({编号=19531,品质=4,星星=15,五行属性=2,灵魂增伤=5})
            --     当前角色:制造装备({编号=19581,品质=4,星星=15,五行属性=2,灵魂增伤=5})
            --     当前角色:制造装备({编号=19631,品质=4,星星=15,五行属性=2,灵魂增伤=5})
            --     当前角色:制造装备({编号=19681,品质=4,星星=15,五行属性=2,灵魂增伤=5})
			-- 	当前角色:制造装备({编号=13011,品质=4,星星=15,五行属性=2,灵魂增伤=5})
			-- 	当前角色:制造装备({编号=13511,品质=4,星星=15,五行属性=2,灵魂增伤=5})
			-- 	当前角色:制造装备({编号=14011,品质=4,星星=15,五行属性=2,灵魂增伤=5})
			-- 	当前角色:制造装备({编号=14511,品质=4,星星=15,五行属性=2,灵魂增伤=5})
			-- 	当前角色:制造装备({编号=14611,品质=4,星星=15,五行属性=2,灵魂增伤=5})
			-- 	当前角色:制造装备({编号=19080,品质=4,星星=15,五行属性=2,灵魂增伤=5})
			-- 	当前角色:制造装备({编号=19230,品质=4,星星=15,五行属性=2,灵魂增伤=5})
            --     当前角色:制造装备({编号=19012,品质=4,星星=15,五行属性=3,灵魂增伤=5})
            --     当前角色:制造装备({编号=19062,品质=4,星星=15,五行属性=0,灵魂增伤=5})
            --     当前角色:制造装备({编号=19062,品质=4,星星=15,五行属性=0,灵魂增伤=5})
			-- 	当前角色:制造装备({编号=19811,品质=4,星星=15,五行属性=3,灵魂增伤=5})
			-- 	当前角色:制造装备({编号=19861,品质=4,星星=15,五行属性=0,灵魂增伤=5})
			-- 	当前角色:制造装备({编号=19911,品质=4,星星=15,五行属性=0,灵魂增伤=5})
			-- 	当前角色:制造装备({编号=19911,品质=4,星星=15,五行属性=0,灵魂增伤=5})
			-- 	当前角色:制造装备({编号=19960,品质=4,星星=15,五行属性=2,灵魂增伤=5})        
            --     当前角色:增加物品(60000,1,0,0,true)    
            --     当前角色:增加物品(60001,1,0,0,true)    
            --     当前角色:增加物品(60002,1,0,0,true)    
            --     当前角色:增加物品(60003,1,0,0,true)    
            --     当前角色:增加物品(60004,1,0,0,true)    
            --     当前角色:增加物品(60005,1,0,0,true)  
            --     当前角色:增加物品(51000,50000,0,0,true)    
            --     当前角色:增加物品(51010,50000,0,0,true)    
            --     当前角色:增加物品(51020,50000,0,0,true)    
            --     当前角色:增加物品(51030,50000,0,0,true)  
            --     当前角色:增加物品(3809,50000,0,0,true)    
            --     当前角色:增加物品(3812,50000,0,0,true)    
            --     当前角色:增加物品(3809,50000,0,0,true)    
            --     当前角色:增加物品(50000,50000,0,0,true)    
            --     当前角色:增加物品(3812,50000,0,0,true)    
            --     当前角色:增加物品(1140,500,0,0,true)    
            --     当前角色:增加物品(1141,50000,0,0,true)    
            --     当前角色:增加物品(1153,50000,0,0,true)    
            --     当前角色:增加物品(5312,50000,0,0,true)    
            --     当前角色:增加物品(5313,50000,0,0,true)   
            --     当前角色:增加物品(120037,50000,0,0,true)    
            --     当前角色:增加物品(120038,50000,0,0,true)    
            --     当前角色:增加物品(120039,50000,0,0,true)    
            --     当前角色:增加物品(120040,50000,0,0,true)    
            --     当前角色:增加物品(120041,50000,0,0,true)    
            --     当前角色:增加物品(120042,50000,0,0,true)    
            --     当前角色:增加物品(120043,50000,0,0,true)    
            --     当前角色:增加物品(120044,50000,0,0,true)    
            --     当前角色:增加物品(120045,50000,0,0,true)    
            --     当前角色:增加物品(120046,50000,0,0,true)    
            --     当前角色:增加物品(5314,50000,0,0,true)    
            --     当前角色:增加物品(1150,50000,0,0,true)    
            --     当前角色:增加物品(50129,50000,0,0,true)    
            --     当前角色:增加物品(50109,50000,0,0,true)    
        elseif flag == 4 then
            当前角色:制造装备({编号=19331,品质=4,星星=15,五行属性=2,灵魂增伤=5})
            当前角色:制造装备({编号=19531,品质=4,星星=15,五行属性=2,灵魂增伤=5})
            当前角色:制造装备({编号=19581,品质=4,星星=15,五行属性=2,灵魂增伤=5})
            当前角色:制造装备({编号=19631,品质=4,星星=15,五行属性=2,灵魂增伤=5})
            当前角色:制造装备({编号=19681,品质=4,星星=15,五行属性=2,灵魂增伤=5})
            当前角色:制造装备({编号=13011,品质=4,星星=15,五行属性=2,灵魂增伤=5})
            当前角色:制造装备({编号=13511,品质=4,星星=15,五行属性=2,灵魂增伤=5})
            当前角色:制造装备({编号=14011,品质=4,星星=15,五行属性=2,灵魂增伤=5})
            当前角色:制造装备({编号=14511,品质=4,星星=15,五行属性=2,灵魂增伤=5})
            当前角色:制造装备({编号=14611,品质=4,星星=15,五行属性=2,灵魂增伤=5})
            当前角色:制造装备({编号=19080,品质=4,星星=15,五行属性=2,灵魂增伤=5})
            当前角色:制造装备({编号=19230,品质=4,星星=15,五行属性=2,灵魂增伤=5})
            当前角色:制造装备({编号=19012,品质=4,星星=15,五行属性=3,灵魂增伤=5})
            当前角色:制造装备({编号=19062,品质=4,星星=15,五行属性=0,灵魂增伤=5})
            当前角色:制造装备({编号=19062,品质=4,星星=15,五行属性=0,灵魂增伤=5})
            当前角色:制造装备({编号=19811,品质=4,星星=15,五行属性=3,灵魂增伤=5})
            当前角色:制造装备({编号=19861,品质=4,星星=15,五行属性=0,灵魂增伤=5})
            当前角色:制造装备({编号=19911,品质=4,星星=15,五行属性=0,灵魂增伤=5})
            当前角色:制造装备({编号=19911,品质=4,星星=15,五行属性=0,灵魂增伤=5})
            当前角色:制造装备({编号=19960,品质=4,星星=15,五行属性=2,灵魂增伤=5})        
                
	elseif flag == 5 then
                -- 当前角色:制造装备({编号=10620,品质=4,星星=15,五行属性=2,灵魂增伤=5})
                -- 当前角色:制造装备({编号=14000,品质=4,星星=15,五行属性=2,灵魂增伤=5})
				-- 当前角色:制造装备({编号=10069,品质=4,星星=15,五行属性=2,灵魂增伤=5})
				-- 当前角色:制造装备({编号=10219,品质=4,星星=15,五行属性=2,灵魂增伤=5})
                -- 当前角色:制造装备({编号=10990,品质=4,星星=15,五行属性=3,灵魂增伤=5})
                -- 当前角色:制造装备({编号=11040,品质=4,星星=15,五行属性=0,灵魂增伤=5})
                -- 当前角色:制造装备({编号=11040,品质=4,星星=15,五行属性=0,灵魂增伤=5})
				-- 当前角色:制造装备({编号=10789,品质=4,星星=15,五行属性=3,灵魂增伤=5})
				-- 当前角色:制造装备({编号=10839,品质=4,星星=15,五行属性=0,灵魂增伤=5})
				-- 当前角色:制造装备({编号=10889,品质=4,星星=15,五行属性=0,灵魂增伤=5})
				-- 当前角色:制造装备({编号=10889,品质=4,星星=15,五行属性=0,灵魂增伤=5})
				-- 当前角色:制造装备({编号=10938,品质=4,星星=15,五行属性=2,灵魂增伤=5})
                当前角色:增加物品(60000,1,0,0,true)    
            当前角色:增加物品(60001,1,0,0,true)    
            当前角色:增加物品(60002,1,0,0,true)    
            当前角色:增加物品(60003,1,0,0,true)    
            当前角色:增加物品(60004,1,0,0,true)    
            当前角色:增加物品(60005,1,0,0,true)  
            当前角色:增加物品(51000,50000,0,0,true)    
            当前角色:增加物品(51010,50000,0,0,true)    
            当前角色:增加物品(51020,50000,0,0,true)    
            当前角色:增加物品(51030,50000,0,0,true)  
            当前角色:增加物品(3809,50000,0,0,true)    
            当前角色:增加物品(3812,50000,0,0,true)    
            当前角色:增加物品(3809,50000,0,0,true)    
            当前角色:增加物品(50000,50000,0,0,true)    
            当前角色:增加物品(3812,50000,0,0,true)    
            当前角色:增加物品(1140,500,0,0,true)    
            当前角色:增加物品(1141,50000,0,0,true)    
            当前角色:增加物品(1153,50000,0,0,true)    
            当前角色:增加物品(5312,50000,0,0,true)    
            当前角色:增加物品(5313,50000,0,0,true)   
            当前角色:增加物品(120037,50000,0,0,true)    
            当前角色:增加物品(120038,50000,0,0,true)    
            当前角色:增加物品(120039,50000,0,0,true)    
            当前角色:增加物品(120040,50000,0,0,true)    
            当前角色:增加物品(120041,50000,0,0,true)    
            当前角色:增加物品(120042,50000,0,0,true)    
            当前角色:增加物品(120043,50000,0,0,true)    
            当前角色:增加物品(120044,50000,0,0,true)    
            当前角色:增加物品(120045,50000,0,0,true)    
            当前角色:增加物品(120046,50000,0,0,true)    
            当前角色:增加物品(5314,50000,0,0,true)    
            当前角色:增加物品(1150,50000,0,0,true)    
            当前角色:增加物品(50129,50000,0,0,true)    
            当前角色:增加物品(50109,50000,0,0,true)
			elseif flag == 6 then
                当前角色:制造装备({编号=12009,品质=4,星星=15,五行属性=2,灵魂增伤=5})
				当前角色:制造装备({编号=12509,品质=4,星星=15,五行属性=2,灵魂增伤=5})
				当前角色:制造装备({编号=10119,品质=4,星星=15,五行属性=4,灵魂增伤=5})
				当前角色:制造装备({编号=10269,品质=4,星星=15,五行属性=4,灵魂增伤=5})
                当前角色:制造装备({编号=10989,品质=4,星星=15,五行属性=3,灵魂增伤=5})
                当前角色:制造装备({编号=11039,品质=4,星星=15,五行属性=0,灵魂增伤=5})
                当前角色:制造装备({编号=11039,品质=4,星星=15,五行属性=0,灵魂增伤=5})
				当前角色:制造装备({编号=10790,品质=4,星星=15,五行属性=0,灵魂增伤=5})
                当前角色:制造装备({编号=10840,品质=4,星星=15,五行属性=2,灵魂增伤=5})
                当前角色:制造装备({编号=10890,品质=4,星星=15,五行属性=2,灵魂增伤=5})
                当前角色:制造装备({编号=10890,品质=4,星星=15,五行属性=2,灵魂增伤=5})
                当前角色:制造装备({编号=10937,品质=4,星星=15,五行属性=4,灵魂增伤=5})
			elseif flag == 7 then
                当前角色:制造装备({编号=12010,品质=4,星星=15,五行属性=2,灵魂增伤=5})
				当前角色:制造装备({编号=12510,品质=4,星星=15,五行属性=4,灵魂增伤=5})
				当前角色:制造装备({编号=10069,品质=4,星星=15,五行属性=2,灵魂增伤=5})
				当前角色:制造装备({编号=10219,品质=4,星星=15,五行属性=2,灵魂增伤=5})
                当前角色:制造装备({编号=10990,品质=4,星星=15,五行属性=3,灵魂增伤=5})
                当前角色:制造装备({编号=11040,品质=4,星星=15,五行属性=0,灵魂增伤=5})
                当前角色:制造装备({编号=11040,品质=4,星星=15,五行属性=0,灵魂增伤=5})
				当前角色:制造装备({编号=10789,品质=4,星星=15,五行属性=3,灵魂增伤=5})
				当前角色:制造装备({编号=10839,品质=4,星星=15,五行属性=0,灵魂增伤=5})
				当前角色:制造装备({编号=10889,品质=4,星星=15,五行属性=0,灵魂增伤=5})
				当前角色:制造装备({编号=10889,品质=4,星星=15,五行属性=0,灵魂增伤=5})
				当前角色:制造装备({编号=10938,品质=4,星星=15,五行属性=2,灵魂增伤=5})
			elseif flag == 8 then
                当前角色:制造装备({编号=11505,品质=4,星星=15,五行属性=2,灵魂增伤=5})
				当前角色:制造装备({编号=14700,品质=4,星星=15,五行属性=2,灵魂增伤=5})
				当前角色:制造装备({编号=10069,品质=4,星星=15,五行属性=2,灵魂增伤=5})
				当前角色:制造装备({编号=10219,品质=4,星星=15,五行属性=2,灵魂增伤=5})
                当前角色:制造装备({编号=10990,品质=4,星星=15,五行属性=3,灵魂增伤=5})
                当前角色:制造装备({编号=11040,品质=4,星星=15,五行属性=0,灵魂增伤=5})
                当前角色:制造装备({编号=11040,品质=4,星星=15,五行属性=0,灵魂增伤=5})
				当前角色:制造装备({编号=10789,品质=4,星星=15,五行属性=3,灵魂增伤=5})
				当前角色:制造装备({编号=10839,品质=4,星星=15,五行属性=0,灵魂增伤=5})
				当前角色:制造装备({编号=10889,品质=4,星星=15,五行属性=0,灵魂增伤=5})
				当前角色:制造装备({编号=10889,品质=4,星星=15,五行属性=0,灵魂增伤=5})
				当前角色:制造装备({编号=10938,品质=4,星星=15,五行属性=2,灵魂增伤=5})
            end
        end
    end
	return 0
end

function 增伤装备领取(str,参数)
	local 当前角色 = me()
	local v = 当前角色.任务:vars(888888)
    if v == nil then
        当前角色.任务:add(888888,Vars(888888),当前角色,false)
        v = 当前角色.任务:vars(888888)
    end
    local 增伤装备状态 = v:get("增伤装备")
	local 背包空间 = 当前角色:包裹空间()

	if 增伤装备状态 == 0 then
        if str == "friday" then
            if 临时NPC then
				if 背包空间 < 32 then
                   消息(当前角色,17,"包裹空间不足,请清理背包之后再来领取!")	 
				else
			       show_dialog(临时NPC, menu_848_领取装备)
			    end	
            end
            return 1	    		
        else
            消息(当前角色,17,"领取码错误.")
        end
	
    else
        消息(当前角色,17,"已经领取过礼包了,请勿重复领取")
show_dialog(临时NPC, menu_848_领取装备)

    end
	return 0
end